app/views/comment/index.html.erb

SELECT "comments".* FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 2]]
SELECT "replies".* FROM "replies"  WHERE "replies"."comment_id" IN (1)
---

<% @post.comments.includes(:replies).each do |comments| %>