app/views/devise/registrations/edit.html.erb

    <%= f.label :interests %>
    <% Subject.all.sort_by(&:name).each do |subject| %>
---
SELECT "subjects".* FROM "subjects"