app/views/devise/registrations/new.html.erb

      <%= f.label :interests %>
      <% Subject.all.each do |subject| %>
---
SELECT "subjects".* FROM "subjects"