app/views/subject/index.html.erb

  <% @interests_array.each do |subjects| %>
    <% subjects.posts.each do |post| %>
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."subject_id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["subject_id", 2]]

      <div class="post-data">
        <div class="comments">There are: <%= post.comments.count %><%= link_to ' Comment(s)', post_comment_index_path(post) %></div>
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]