app/views/post/index.html.erb

<p><strong>Subject:</strong></p>
<p><%= Subject.find(post.subject_id).name %></p><br>
---
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 3]]

<div class="post-data">
  <div class="comments">There are: <%= post.comments.count %><%= link_to ' Comment(s)', post_comment_index_path(post) %></div>
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."post_id" = ?  [["post_id", 1]]