app/views/interest/index.html.erb

SELECT "subjects".* FROM "subjects"
---
  <%= f.label :interests %>
  <% Subject.all.each do |subject| %>