app/controllers/comment_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
---
  def index
    @post = Post.find(params[:post_id])

INSERT INTO "comments" ("comment", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "this is a new commnet"], ["created_at", "2016-08-13 15:00:41.831934"], ["post_id", 2], ["updated_at", "2016-08-13 15:00:41.831934"], ["user_id", 1]]
---
  def create
    @comment = new_comment_params
    if @comment.save

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = 3 LIMIT 1
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 3]]
---
  def destroy
    @comment = Comment.find_by(id: params[:id])
    authorize @comment
    @comment.destroy

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = 4 LIMIT 1
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 3]]
---
  def edit
    @comment = Comment.find_by(id: params[:id])
    @post = Post.find(params[:post_id])

SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 4]]
UPDATE "comments" SET "comment" = ?, "updated_at" = ? WHERE "comments"."id" = 4  [["comment", "moreedits"], ["updated_at", "2016-08-13 15:15:56.512019"]]
---
  def update
    @comment = Comment.find(params[:id])
    authorize @comment
      if @comment.update(comment: params[:comment][:comment])