app/controllers/editinterest_controller.rb

  def index
    @interests = Subject.all
---
SELECT "subjects".* FROM "subjects"

  def create
    current_user.interests = params[:editinterest][:interests].to_json
    current_user.save
---
UPDATE "users" SET "interests" = ?, "updated_at" = ? WHERE "users"."id" = 12  [["interests", "[\"7\",\"3\"]"], ["updated_at", "2016-08-25 00:48:14.294997"]]