app/controllers/interest_controller.rb

  def index
    @subjects = Subject.all.sort_by(&:name)
---
SELECT "subjects".* FROM "subjects"

  def create
    current_user.interests = params[:interest][:interests].to_json
    if current_user.save
---
UPDATE "users" SET "interests" = ?, "updated_at" = ? WHERE "users"."id" = 9  [["interests", "[\"1\",\"7\"]"], ["updated_at", "2016-08-22 14:48:38.421941"]]