app/controllers/plock_controller.rb

INSERT INTO "users" ("created_at", "email", "encrypted_password", "interests", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
UPDATE "users" SET "current_sign_in_at" = ?, "current_sign_in_ip" = ?, "last_sign_in_at" = ?, "last_sign_in_ip" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = 22
---
  def create
    super
    current_user.interests = params[:user][:interests].to_json
    if current_user.save

UPDATE "users" SET "interests" = ?, "updated_at" = ? WHERE "users"."id" = 25  [["interests", "[\"1\",\"3\",\"5\"]"], ["updated_at", "2016-08-15 21:18:03.818142"]]
---
  def update
    current_user.interests = params[:user][:interests].to_json
    current_user.save