app/controllers/post_controller.rb

  def new
    @interests_array = []
    JSON.parse(current_user.interests).each do |f|
      if Subject.find(f)
---
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]

  def create
    new_post
    @post.save!
---
INSERT INTO "posts" ("content", "created_at", "subject_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "this post is new"], ["created_at", "2016-08-13 14:51:37.123536"], ["subject_id", 1], ["title", "new post"], ["updated_at", "2016-08-13 14:51:37.123536"], ["user_id", 1]]

  def destroy
    @post = Post.find(params[:id])
    authorize @post
    @post.destroy
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]

  def edit
    @post = Post.find(params[:id])
    @interests_array = []
    @interests = JSON.parse(current_user.interests).each do |f|
      if Subject.find(f)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 2]]

  def update
    @post = Post.find params[:id]
    @subject = Subject.find(params[:post][:subject_id].downcase)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 1]]