app/controllers/reply_controller.rb

  def index
    @comment = Comment.find(params[:comment_id])
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @comment = Comment.find(params[:comment_id])
    @reply = @comment.replies.new(comment_id: @comment.id, content: params[:reply][:content])
    if @reply.save
---
SELECT  "comments".* FROM "comments"  WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "replies" ("comment_id", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment_id", 1], ["content", "this is a reply the comment"], ["created_at", "2016-08-13 15:02:02.212673"], ["updated_at", "2016-08-13 15:02:02.212673"]]