app/controllers/subject_controller.rb

  def index
    @subject = Subject.all.includes(:posts => [:user])
    @interests_array = []
    @interests = JSON.parse(current_user.interests).each do |f|
      if Subject.find(f)
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."subject_id" = ?  ORDER BY "posts"."id" ASC LIMIT 1  [["subject_id", 2]]
SELECT "subjects".* FROM "subjects"
SELECT "users".* FROM "users"  WHERE "users"."id" IN (1)
SELECT  "subjects".* FROM "subjects"  WHERE "subjects"."id" = ? LIMIT 1  [["id", 3]]